pascal-3.2/tutorials/zeljko/sloshing2D/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="newInterTrackFoam"

runApplication makeFaMesh
runApplication $application
