pascal-3.2/tutorials/zeljko/sloshing2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
freeSurfaceShadow
{
    type patch;
    nFaces 20;
    startFace 1520;
}

topWall
{
    type patch;
    nFaces 20;
    startFace 1540;
}

rightWall
{
    type wall;
    nFaces 40;
    startFace 1560;
}

bottomWall
{
    type patch;
    nFaces 20;
    startFace 1600;
}

leftWall
{
    type wall;
    nFaces 40;
    startFace 1620;
}

freeSurface
{
    type patch;
    nFaces 20;
    startFace 1660;
}

frontAndBack
{
    type empty;
    nFaces 1600;
    startFace 1680;
}
)

// ************************************************************************* //
